Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_when_appealing_a_social_welfare_decision.html.txt.tmx
Source language: en
Languages: ga

source: Checklist when appealing a social welfare decision
ga: Seicliosta nuair atá achomharc á dhéanamh in aghaidh chinnidh leasa shóisialaigh

source: Appealing a social welfare decision
ga: Má tá tú míshásta le cinneadh a rinne an Roinn Coimirce Sóisialaí faoi íocaíocht, tá sé de rogha agat achomharc a dhéanamh in aghaidh an chinnidh sin

source: If you are unhappy with a decision of the Department of Social Protection you can make an appeal
ga: Sula ndéanann tú achomharc, ní mór socrú an féidir achomharc a dhéanamh i gcoinne an chinnidh agus cé leis a ndéanfaidh tú an t-achomharc

source: Depending on the type of payment, you appeal either to the Social Welfare Appeals Office or the Department of Social Protection
ga: Déanfar an t-achomharc chuig Oifig Achomhairc Leasa Shóisialaigh nó leis an Roinn Coimirce Sóisialaí, braitheann sé ar an gcineál íocaíochta

source: There are a number of stages involved in the appeal process
ga: Tá céimeanna éagsúla sa nós imeachta achomhairc

source: This checklist outlines these stages and explains the process involved in making an appeal to the Social Welfare Appeals Office
ga: Cuireann an seicliosta seo na céimeanna seo in iúl agus míníonn sé próiseas an achomhairc

source: Is the payment or scheme you wish to appeal covered by the Social Welfare Appeals Office?
ga: An féidir an t-achomharc a dhéanamh leis an Oifig Achomhairc Leasa Shóisialaigh?

source: Most social welfare schemes are covered by the Social Welfare Appeals Office (pdf)
ga: Léirítear na scéimeanna leasa shóisialaigh gur féidir achomharc foirmeálta a dhéanamh ina n-aghaidh (pdf)

source: If the payment or scheme you wish to appeal is not covered by the Social Welfare Appeals Office, you can ask for a review of the decision by the Department of Social Protection but you cannot bring it to a formal appeal
ga: Mura bhfuil an íocaíocht nó an scéim gur mhaith leat achomharc a dhéanamh uirthi clúdaithe ag an Oifig Achomhairc, tá sé de rogha agat iarraidh go ndéanfadh an Roinn Coimirce Sóisialaí an cinneadh a athbhreithniú, ach ní féidir achomharc foirmeálta a dhéanamh

source: Are you within the time limits for making an appeal?
ga: An bhfuil tú laistigh den teorainn ama chun achomharc a dhéanamh?

source: Generally you have 21 days following the decision to get your appeal into the Social Welfare Appeals Office
ga: Go hiondúil, ní mór achomharc a dhéanamh leis an Oifig Achomhairc laistigh de 21 lá ó rinneadh an cinneadh

source: If your application is late, you must give the reasons why it is late
ga: Má tá d'iarratas déanach, ní foláir duit cúiseanna na moille sin a léiriú

source: Appeals Officers do not have to accept late applications
ga: Níl dualgas ar na hOifigigh Achomhairc glacadh le hiarratais dhéanacha

source: Do you need help with making your appeal?
ga: An bhfuil cabhair uait chun an t-achomharc a dhéanamh?

source: Some voluntary organisations (such as your local Citizens Information Centre) can help you to decide if you have grounds for an appeal
ga: Tá roinnt eagraíochtaí deonacha ann (ar nós an tIonad Faisnéise do Shaoránaigh áitiúil) agus is féidir leo treoir a thabhairt duit le socrú an bhfuil foras achomhairc agat

source: They can help you to prepare your case and may even go with you on the day of your oral hearing
ga: Is féidir leo do chás a ullmhú leat agus féadfaidh siad dul mar ionadaí leat ar lá d'éisteachta

source: Why you do not agree with the Department of Social Protection's decision?
ga: Cén fáth nach raibh tú sásta le cinneadh na Roinne? Leag amach na cúiseanna cén fáth

source: Set out why you do not agree with the Department's decision
ga: An bhfuil do cháipéisí ar fad agat chun do chás a chruthú?

source: All your documents on the appeal file should be arranged in date order
ga: Ba chóir cáipéisí sa chomhad achomhairc a eagrú de réir dátaí

source: You may find it useful to read some examples of cases taken to the Social Welfare Appeals Office
ga: Sa chás nach bhfuil ach fótachóipeanna le fáil, ba chóir iad a bheith d'ardchaighdeán agus soléite

source: Put in your 'Notice of Appeal (pdf)' with the information you have gathered before the 21 day deadline
ga: Cuir an fhoirm "Cuir isteach d'Fhógra Achomhairc" faoi bhráid na hOifige Achomharc leis an bhfaisnéis atá bailithe agat roimh an spriocdháta 21 lá

source: Remember, the Notice of Appeal should contain:
ga: Cuimhnigh, ba chóir an t-eolas seo a leanas a bheith san fhógra achomhairc:

source: • Your name and address
ga: D'ainm agus do sheoladh

source: • Your Personal Public Service Number
ga: • D'Uimhir Phearsanta Seirbhíse Poiblí

source: • The decision you are appealing
ga: • An cinneadh a bhfuil achomharc á dhéanamh agat ina aghaidh

source: • Write down all the facts and points that support why you believe the Departments's decision was wrong
ga: • Ráiteas leis na fíricí agus pointí a bheidh á n-úsáid agat san achomharc

source: You should also add any documentary evidence you have, for example, copies of letters from the Department, your doctor or social worker
ga: Ba chóir fianaise fhaisnéiseach chun tacú le do chás a chur faoi bhráid na hOifige Achomharc leis an bhFógra Achomhairc

source: (If you need help with this or any part of your appeal contact your local Citizens Information Centre.)
ga: • Ba cheart cóip den litir ón Roinn chuig an Oifigeach Cinnidh maidir leis an achomharc a bheith sa litir chomh maith

source: Has the Social Welfare Appeals Office confirmed in writing they got your appeal?
ga: Ar dhearbhaigh an Oifig Achomhairc i scríbhinn go bhfuair siad d'achomharc?

source: It will contain your Appeal Reference Number
ga: Beidh d'Uimhir Tagartha Achomhairc leis an dearbhú

source: You should put your Appeal Reference Number on all written communication with the Social Welfare Appeals Office
ga: Ba chóir an uimhir seo a thabhairt i gcumarsáidí go léir leis an Roinn as seo amach

source: Social welfare appeal hearings
ga: Éisteachtaí Achomharc Leasa Shóisialaigh

source: Did you get a letter with a decision from the Social Welfare Appeals Office?
ga: An bhfuair tú fógra den chinneadh i scríbhinn nó ar iarradh ort teacht chuig agallamh chun do chás a phlé?

source: The Appeals Officer can make a decision using the information you sent in your Notice of Appeal. However, the Appeals Officer may wish to talk with you before making a decision. In this case, you will get a letter to attend an oral hearing
ga: D'fhéadfadh na hOifigigh Achomhairc cuireadh a thabhairt duit teacht chuig agallamh chun do chás a phlé nó d'fhéadfaidís cinneadh a dhéanamh ar d'achomharc bunaithe ar an bhfianaise atá curtha isteach agat

source: Did you get a letter requesting you to attend an oral hearing?
ga: Ar chuimhnigh tú ar dháta, am agus áit an agallaimh? Ní mór teacht in am

source: You will get a letter asking you to attend an oral hearing if the Appeals Officer wants to ask you more about your case
ga: Tá na hagallaimh achomharc neamhchoimhlinteach. Is í aidhm an Oifigigh Achomhairc ná éisteacht le do chás agus déanfaidh sé cinneadh cothrom

source: Don't worry - an oral hearing is a good opportunity for the Appeals Officer to get to know your case in more detail
ga: Mura féidir leat teacht, ba chóir teagmháil a dhéanamh leis an oifig chomh luath agus is féidir ionas gur féidir athrú dáta a shocrú

source: Appeal hearings are non-confrontational
ga: Cinntí achomharc Leasa Shóisialaigh

source: You will be given a decision on your case
ga: Tabharfar cinneadh ar do chás duit

source: The Appeals Officer will notify you of his/her decision and the reasons for that decision in writing
ga: Cuirfidh an t-Oifigeach Achomhairc a c(h)inneadh, agus na fáthanna atá leis an gcinneadh sin, chugat i scríbhinn

source: A similar letter will be sent to the Department at the same time
ga: Cuirfear litir den chineál céanna chuig an Roinn ag an am céanna

source: If there has been an oral hearing, you will get the Appeals Officer's decision within three of four weeks
ga: Má bhí agallamh ann, gheobhaidh tú cinneadh an Oifigigh Achomhairc laistigh de trí nó ceithre mhí

source: The Appeals Officer will decide on the appeal and tell you of the decision in writing
ga: Tabharfaidh an tOifigeach Achomhairc breith ar d'achomharc agus cuirfidh sé an bhreith sin in iúl chugat i scríbhinn

source: If your appeal is not successful the Appeals Officer will explain why
ga: Má theipeann ar d'achomharc, míneoidh Oifigeach na nAchomharc cén fáth

source: In either case you should submit a written statement of the grounds on which a review is sought
ga: Seo roinnt ceisteanna a chuirtear go minic maidir le hachomharc a dhéanamh
